alfresco/java-opensaml2-main/java-opensaml2/src/test/resources/data/org/opensaml/saml2/binding/AttributeQuerySOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
	<soap11:Body>
		<samlp:AttributeQuery xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
			xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
			ID="abe567de6" Version="2.0" IssueInstant="2005-01-31T12:00:00.000Z"
			Destination="https://idp.example.com/idp/aa">
			<saml:Subject>
				<saml:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress">
					j.doe@company.com
				</saml:NameID>
			</saml:Subject>
		</samlp:AttributeQuery>
	</soap11:Body>
</soap11:Envelope>
